webapp/app/controllers/site_controller.rb

  def search
    @movies = Movie.find(:all, :conditions => ['MATCH(name) AGAINST (?)', params[:q]])
---
SELECT * FROM `movies` WHERE (MATCH(name) AGAINST ('toy story'))

  def movie
    @movie = Movie.find_by_id(params[:id])
---
SELECT * FROM `movies` WHERE (id in (3114,4886,8961,1223,720,60069,1914,6377,1254,3606,745,32160,50872,3783,26662,5289,54286,3429,8739,1068))